import { NavLink } from "react-router-dom";
import style from "./PrivacyPolicy.module.scss";

const PrivacyPolicy = () => {
  return (
    <div className={style.privacyPolicyWrapper}>
      <NavLink to={"/"}>Back </NavLink>
      <text>
        ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ редакція від 13.04.2023 1. Загальні умови 1.1.
        Ця Політика визначає порядок обробки та захисту фізичною
        особою-підприємцем Гончарук Б.В., ІПН 3515110604, e-mail:
        bohdana.projects@gmail.com (далі - "Власником") та її партнерами (далі -
        Партнери) інформації про фізичних осіб (далі — Користувач), яка може
        бути отримана Власником при придбанні Користувачем послуг/товарів,
        невиключної ліцензії, що надаються у тому числі за допомогою сайту,
        сервісів, служб, програм, які використовуються Власником та/або
        Партнерами (далі — Сайт, Сервіси). 1.2. Метою цієї Політики є
        забезпечення належного захисту персональної інформації, яку Користувач
        надає про себе самостійно під час використання Сайту, Сервісів або в
        процесі реєстрації, для придбання товарів/послуг, невиключної ліцензії
        від несанкціонованого доступу та розголошення. 1.3. Відносини, пов'язані
        зі збиранням, зберіганням, розповсюдженням та захистом інформації, яку
        надає Користувач, регулюються цією Політикою, іншими офіційними
        документами Власника та чинним законодавством України. 1.4. Реєструючись
        на Сайті та використовуючи Сайт та Сервіси Користувач висловлює свою
        повну згоду з умовами цієї Політики. 1.5. У разі незгоди Користувача з
        умовами цієї Політики використання Сайту та/або будь-яких Сервісів,
        доступних при використанні Сайту, має бути негайно припинено. 1.6. У
        разі незгоди Користувача щодо отримання інформації від Власника та/або
        Партнерів Користувач може відписатися від розсилки: шляхом надсилання
        повідомлення до Direct облікового запису соціальної мережі Instagram .
        При надходженні повідомлення до Direct облікового запису соціальної
        мережі Instagram створюється звернення за підсумками отриманої від
        Користувача інформації. Звернення обробляється максимум протягом 24
        годин. В результаті інформація про Користувача не включається до
        сегменту розсилок. 2. Цілі збору, обробки та зберігання інформації, що
        надається користувачами Сайту 2.1. Обробка персональних даних
        Користувача здійснюється відповідно до законодавства України. Власник
        обробляє персональні дані Користувача з метою: ідентифікації сторони в
        рамках угод та договорів, що укладаються з Власником та/або Партнерами;
        надання Користувачеві товарів/послуг, доступу до Сайту, Сервісів;
        зв'язку з Користувачем, направленні Користувачеві транзакційних листів у
        момент отримання заявки реєстрації на Сайті або отриманні оплати від
        Користувача, разово, якщо Користувач здійснює ці дії, направленні
        Користувачеві повідомлень, запитів; направленні Користувачеві
        повідомлень рекламного та/або інформаційного характеру; перевірки,
        дослідження та аналізу таких даних, що дозволяють підтримувати та
        покращувати сервіси та розділи Сайту, а також розробляти нові сервіси та
        розділи Сайту; проведення статистичних та інших досліджень, на основі
        знеособлених даних. обробка вищевказаних персональних даних може
        здійснюватися шляхом змішаної обробки персональних даних, і може
        включати збір, систематизацію, накопичення, зберігання, уточнення,
        знеособлення, блокування, знищення персональних даних. персональні дані
        можуть передаватися третім особам з використанням мереж загального
        користування та міжнародного інформаційного обміну, з використанням
        транскордонної передачі даних на території іноземних держав, у тому
        числі й у разі, якщо цими країнами не забезпечується адекватний захист
        прав суб'єктів персональних даних з метою отримання Користувачем
        товарів/ послуг, а також для досягнення інших цілей. персональні дані
        можуть опрацьовуватися протягом усього строку позовної давності,
        передбаченого законодавством України щодо укладеного Користувачем з
        Власником та/або Партерами Договору. 3. Умови обробки персональної
        інформації наданої Користувачем та її передачі третім особам 3.1.
        Власник вживає всіх необхідних заходів для захисту персональних даних
        Користувача від неправомірного доступу, зміни, розкриття чи знищення.
        3.2. Власник надає доступ до персональних даних Користувача лише тим
        працівникам, підрядникам та Партнерам, яким ця інформація необхідна для
        забезпечення функціонування Сайту, Сервісів та надання Послуг, продажу
        товарів, отримання невиключної ліцензії Користувачем. 3.3. Власник має
        право використовувати надану Користувачем інформацію, у тому числі
        персональні дані, з метою забезпечення дотримання вимог чинного
        законодавства України (у тому числі з метою запобігання та/або
        припинення незаконних та/або протиправних дій Користувачів). Розкриття
        наданої Користувачем інформації може бути здійснене лише відповідно до
        чинного законодавства України на вимогу суду, правоохоронних органів, а
        також в інших передбачених законодавством України випадках. 3.4. Власник
        не перевіряє достовірність інформації, яку надає Користувач, і виходить
        з того, що Користувач в рамках сумлінності надає достовірну та достатню
        інформацію, піклується про своєчасність внесення змін до раніше наданої
        інформації при появі такої необхідності, включаючи, але не обмежуючись
        зміною номера телефону. 4. Умови користування Сайтом, Сервісами,
        Навчальними матеріалами 4.1. Користувач при користуванні Сайтом,
        навчальними матеріалами підтверджує, що: має всі необхідні права, що
        дозволяють йому здійснювати реєстрацію та використовувати Послуги,
        пропоновані Власником; вказує достовірну інформацію про себе в обсягах,
        необхідних для користування Послугами Сайту, обов'язкові для заповнення
        поля для подальшого надання Послуг сайту позначені спеціальним чином,
        вся інша інформація надається користувачем на власний розсуд.
        усвідомлює, що інформація на Сайті, що розміщується Користувачем про
        себе, може ставати доступною для третіх осіб, не обумовлених у цій
        Політиці та може бути скопійована та розповсюджена ними; ознайомлений із
        цією Політикою, висловлює свою згоду з нею та приймає на себе зазначені
        в ній права та обов'язки. Ознайомлення з умовами цієї Політики,
        розміщеної на сайті, є письмовою згодою Користувача на збирання,
        зберігання, обробку та передачу третім особам персональних даних, що
        надаються Користувачем. 4.2. Власник не перевіряє достовірність
        інформації, що одержується (збирається) про Користувачів, за винятком
        випадків, коли така перевірка необхідна з метою виконання зобов'язань
        перед Користувачем. 5. У рамках цієї Політики під «персональною
        інформацією Користувача» розуміються: 5.1. Дані, надані Користувачем
        самостійно при користуванні Сайтом, Сервісами включаючи але, не
        обмежуючись: Прізвище, ім'я, по батькові; Прізвище, ім'я у латинській
        транскрипції, як вони зазначені у закордонному паспорті; Рік, місяць та
        число народження; Місце народження; Підлога; Адреса електронної пошти;
        Домашній та контактний (мобільний) телефони; дані про зростання, вагу та
        стан здоров'я. 5.2. Дані, які автоматично передаються Сервісам у процесі
        їх використання за допомогою встановленого на пристрої Користувача
        програмного забезпечення, у тому числі IP-адреси, інформації з cookie,
        інформації про браузер користувача (або іншої програми, за допомогою
        якої здійснюється доступ до Сервісів), час доступу адресу запитуваної
        сторінки. 6. Зміна Політики конфіденційності. Застосовне законодавство
        6.1. Власник має право вносити зміни до цієї Політики конфіденційності.
        Під час внесення змін до актуальної редакції вказується дата останнього
        оновлення. Нова редакція Політики набирає чинності з її розміщення, якщо
        інше не передбачено новою редакцією Політики. До цієї Політики та
        відносин між Користувачем та Власником, що виникають у зв'язку із
        застосуванням Політики конфіденційності, підлягає застосуванню право
        України. 7. Зворотній зв'язок. Запитання та пропозиції 7.1. Усі
        пропозиції або питання щодо цієї Політики слід повідомляти в Службу
        підтримки проекту шляхом надсилання повідомлення до Direct облікового
        запису соціальної мережі Instagram.
      </text>
    </div>
  );
};

export default PrivacyPolicy;
