import { NavLink } from "react-router-dom";
import style from "./PublickOfferts.module.scss";

const PublickOfferts = () => {
  return (
    <div className={style.publickOffertsWrapper}>
      <NavLink to={"/"}>Back </NavLink>
      <text>
        ПУБЛІЧНИЙ ДОГОВІР (ОФЕРТА) ПРО НАДАННЯ ІНФОРМАЦІЙНИХ ПОСЛУГ 1. ЗАГАЛЬНІ
        ПОЛОЖЕННЯ 1.1. Цей Публічний договір (далі – Оферта, договір) є
        офіційною пропозицією «Виконавця» щодо надання Інформаційних послуг
        юридичним та/або дієздатним фізичним особам (далі – Замовник) на
        наведених нижче умовах шляхом надання інформації через текстові, відео,
        фото, аудіо уроки/повідомлення – спеціальної форми передачі інформації,
        спрямованої на придбання Замовником додаткових знань, умінь та навичок у
        певній сфері діяльності в результаті використання Замовником особливих
        заходів, які вони визначають на власний розсуд. 1.2. Прийняття (акцепт)
        даної Оферти означає повне та беззастережне прийняття Замовником всіх
        умов без будь-яких винятків та/або обмежень та прирівнюється відповідно
        до ч. 2 ст. 642 Цивільного кодексу України (далі ЦК України) до
        укладання сторонами двостороннього письмового договору на умовах,
        викладених нижче в цій Оферті. 1.3. Цей Публічний договір для надання
        Інформаційних послуг (Оферта) вважається укладеним (акцептованим) з
        моменту прийняття Замовником всіх його умов, а також Правила надання
        інформаційних послуг (далі – Правила). 1.4. Моментом акцептування умов
        цього Договору та Правил є реєстрація Замовника на курсі (заході),
        шляхом додавання його в якості учасника курсу/закритої групи (чату) в
        соціальній мережі Telegram. (і) Реєстрація Замовника на курсі (заході)
        здійснюється після підтвердження проведення оплати Замовником, а саме
        зарахування коштів на рахунок Виконавця, за відповідний курс (захід) в
        розмірі не менше ніж 50% вартості від загальної вартості курсу (заходу).
        1.5. Виконавець та Замовник надають взаємні гарантії своєї право- та
        дієздатності необхідні для укладання та виконання цього Договору на
        надання Інформаційних послуг. ВИЗНАЧЕННЯ І ТЕРМІНИ З метою цієї Оферти
        наведені нижче терміни використовуються в наступному значенні: Оферта –
        публічний договір надання інформаційних послуг. Сайт – адреса:
        https://bohdanahoncharuk.com/, який використовується Виконавцем на
        правах власності. Інформаційні послуги (далі - Послуги)– послуги перелік
        та вартість яких визначено на Сайті. Участь у тематичних марафонах у
        форматі інформаційних послуг, (і) а саме мультимедійних курсів,
        тренінгів, марафонів (у записі та потоковому форматі), (іі) надання
        супутніх інформаційних послуг Виконавця у формі консультацій, за
        допомогою використання безкоштовного програмного забезпечення із
        закритим кодом, що забезпечує шифрований голосовий зв'язок та
        відеозв'язок через Інтернет між комп'ютерами (VoIP ), (ііі) або надання
        інших інформаційно-консультаційних послуг. Формат надання послуг та
        необхідність надання супутніх інформаційних послуг визначаються
        Виконавцем самостійно. Учасник курсів/заходів – Замовнику, якому надано
        Виконавцем обмежений доступ до закритих каналів/чатів/груп створених
        Виконавцем в соціальних мережах. А також, надання Замовнику, в якості
        учасника, доступу до матеріалів, описаних на сайті, у профілі Instagram,
        каналів WhatsApp, Telegram. Виконавець – фізична особа-підприємець
        Гончарук Б.В., ІПН 3515110604, e-mail: bohdana.projects@gmail.com,
        тел.+38 063 737 37 16 Замовник – будь-яка фізична чи юридична особа, яка
        здійснила Акцепт Оферти на викладених в ній умовах. Конфіденційна
        інформація – вся конфіденційна інформація, яку Виконавець цього Договору
        прямо чи опосередковано розкриває або надає Замовнику, з метою
        надання/споживання Інформаційних послуг наданих за цим Договором, що
        стосується персональних даних учасників курсів (заходів), будь-яких
        матеріалів курсів (аудіо, відео, текстових файлів та повідомлень, тощо)
        та всієї іншої інформації, яка обґрунтовано вважається конфіденційною
        Виконавцем; 2. ПРЕДМЕТ ОФЕРТИ 2.1. Предметом цієї Оферти є надання
        Замовнику Інформаційних послуг силами Виконавця відповідно до умов цієї
        Оферти за певну винагороду, що виплачується Замовником Виконавцю.
        Формат, перелік та об’єм наданих послуг визначається Виконавцем окремо,
        в залежності від обраного Замовником курсу (заходу). 3. ОПЛАТА 3.1.
        Вартість послуг визначено на Сайті Виконавця. 3.2. Платежі за цим
        договором здійснюється одним із способів, що пропонуються Замовнику, у
        тому числі при натисканні кнопки «Сплатити», які включають: - Оплата
        електронними коштами; - Оплата через платіжні термінали або
        інтернет-банкінг; — оплата на розрахунковий рахунок Виконавця через банк
        чи банк-еквайєр; - Оплата через спеціально уповноважених агентів
        (фізичних або юридичних осіб) - Іншими способами за попереднім
        погодженням з Виконавцем. 3.3. Надання послуг здійснюється за умови
        передоплати. Замовник має можливість здійснити оплату частинами. Сумма
        оплати, що внесена частково є завдатком і в разі відмови Замовника від
        подальшої повної оплати або від участі у заході Замовнику не
        повертається. 3.4. Оплата послуг здійснюється протягом встановленого
        Виконавцем строку. 3.5. В разі порушення строку оплати встановленого
        Виконавцем більше ніж на 10 робочих днів, Виконавець має право не
        надавати доступу до курсу (заходу) або тимчасово припинити доступ
        Замовника до матеріалів (чатів, груп, каналів в соціальних мережах) до
        здійснення Замовником повної оплати згідно умов Договору. 4. УМОВИ
        НАДАННЯ ІНФОРМАЦІЙНИХ ПОСЛУГ 4.1. Виконавець надає обмежений доступ
        Замовнику до Інформаційних послуг, розміщених у закритих
        WhatsApp-каналах, Telegram та закритих профілях соціальної мережі
        Instagram (далі – «закритих каналів». 4.2. Доступ до Інформаційних
        послуг надається Замовнику за умови здійснення передоплати в розмірі не
        менше ніж 50% від загальної вартості послуг. 4.3. Придбання матеріалу
        тренінгу підтверджується заповненням Замовником відповідної заявки та
        внесенням оплати одним із способів зазначених в п. 3.2. цього Договору
        та вказаних на Сайті при натисканні на кнопку «Оплатити». 4.4. Для
        надання доступу Замовнику до закритих каналів необхідно повідомлення
        Замовником своїх контактних даних , а саме: І’мя та прізвище, мобільний
        номер телефону, імейл. Виконавець не несе відповідальності за точність,
        законність і правдивість персональних даних Замовника, наданих
        Замовником Виконавцю з метою реєстрації його, в якості учасника курсу
        (заходу) та надання йому доступу до закритих каналів. Підключення до
        закритих каналів здійснюється після відправки Замовником
        фото-підтвердження оплати Інформаційних послуг менеджеру у Direct
        соціальній мережі Instagram 4.5. Доступ Замовнику до послуги надається
        протягом 2-х робочих днів з моменту підтвердження отримання Виконавцем
        необхідної суми оплати. Якщо по завершенню цього терміну Замовник, з
        будь-якої причини, не отримав доступу до послуг, Замовник має звернутися
        до служби підтримки Виконавця, з підтвердженням оплати і повідоимити про
        це. Виконавець, в односторонньому порядку може тимчасово припинити
        доступ Замовника до курсу (заходу) в разі порушення Замовником Правил
        надання Інформаційних послуг, до моменту припинення порушень або
        видалити учасника курсу (заходу). При цьому кошти за оплачені послуги
        Замовнику не повертаються. 5. ПРАВА ТА ОБОВ'ЯЗКИ ВИКОНАВЦЯ 5.1.
        Виконавець зобов'язується надавати Замовнику цілодобовий доступ до всіх
        текстових, відео, фото, аудіо-матеріалів, доступ до яких надано
        Замовнику в рамках курсу (заходу). Доступ до цих матеріалів зберігається
        протягом _______ з моменту завершення курсу. 5.2. Виконавець гарантує
        надання Замовнику повної та достовірної інформації про послугу на його
        вимогу. 5.3. Виконувати всі взяті на себе зобов’язання за цим договором.
        5.4. Виконавець має право змінювати умови цієї Оферти в односторонньому
        порядку, шляхом публікації на сайті нової редакції із зазначенням дати
        внесення змін. 6. ПРАВА ТА ОБОВ'ЯЗКИ ЗАМОВНИКА 6.1. Замовник
        зобов'язаний надавати достовірну інформацію про себе у процесі
        заповнення заявки (реєстрації) на Сайті. Замовник відповідає за
        достовірність, чіткість і законність такої інформації. 6.2. Замовник
        зобов'язується не відтворювати, не повторювати, не копіювати, не
        продавати, а також не використовувати з будь-якою метою інформацію та
        матеріали, що стали йому доступними у зв'язку з наданням Інформаційної
        послуги, за винятком їх особистого використання. 6.3. Замовник
        зобов'язаний підтримувати у справному технічному стані обладнання та
        канали зв'язку, які забезпечують доступ до закритих каналів участі.
        Виконавець не несе відповідальності за ненадання (неякісне надання)
        Інформаційної послуги з причин, що не залежать від Виконавця 6.4.
        Замовник зобовязується дотримуватись Правил надання Інформаційних послуг
        протягом всього строку споживання послуг. 6.5. Замовник користується
        всіма правами визначеними чинним законодавством України, зокрема
        Конституцією України, ЗУ «Про захист прав споживачів», Цивільним
        кодексом. 6.6. У разі претензії Замовника, щодо якості наданих
        Виконавцем послуг, Замовник має звернутись до Виконавця, шляхом подання
        відповідної заявки в Direct протягом 10 робочих днів з моменту отримання
        послуги. Строк розгляду претензії Замовника Виконавцем становить 30
        календарних з моменту її отримання Виконавцем. За результатами розгляду
        претензії, Виконавець має надати Замовнику письмову відповідь. 6.7. В
        разі, якщо надані послуги не відповідають якості та/або об’єму завленому
        в описі певного курсу (заходу) на сайті Виконавця. За результатами
        розгляду такої претензії, Виконавцем може бути прийнято одне з наступних
        рішень: 1 про відмову у поверненні коштів, або 2) про задоволення вимоги
        про повернення коштів. (іі) в разі задоволення претензіі кошти Замовнику
        будуть повернені протягом 30 календарних днів на розрахунковий рахунок
        зазначений в претензії. 6.8. Кошти зараховуються на рахунок Замовника,
        протягом 30 календарних днів з моменту прийняття рішення і за умови
        отримання Виконавцем підписаної претензії/вимоги/заяви від Замовника із
        зазначенням банківських реквізитів.Фінансовий документ, що підтверджує
        внесення коштів Виконавцем на рахунок Замовника, є доказом виконання
        Виконавцем обов'язку щодо повернення коштів Замовнику, що беззастережно
        приймається Сторонами. 7. ВІДПОВІДАЛЬНІСТЬ СТОРІН 7.1 Виконавець і
        Замовник, враховуючи характер послуг, що надаються, зобов'язуються у
        разі виникнення спорів та розбіжностей, пов'язаних з виконанням умов
        цього договору, застосовувати досудовий порядок врегулювання спору. У
        разі неможливості врегулювання спору шляхом домовленностей, даний спір
        підлягає розгляду в судовому порядку у відповідній судовій юрисдикції.
        7.2 За невиконання або неналежне виконання зобов'язань за цим договором
        Сторони несуть відповідальність відповідно до чинного законодавства
        України. 8. КОНФІДЕНЦІЙНІСТЬ 8.1 Замовник цим гарантує та зобов'язується
        перед Виконавцем, що він зберігатиме Конфіденційну інформацію в таємниці
        та конфіденційності і не буде, прямо чи опосередковано, використовувати
        будь-яким способом або розкривати Конфіденційну інформацію третім
        особам, за винятком випадків, коли це прямо дозволено цим Договором або
        за письмовою Виконавця. 8.2 Жодні обмеження не застосовуються у зв'язку
        з Конфіденційною інформацією: (a) яка вже була відома Замовнику до її
        повідомлення Виконавцем; (b) яка є або стає публічно відомою, за
        винятком випадків коли інформація стала публічною внаслідок порушення
        цього Договору Замовником; або (c) в тій мірі, в якій розкриття
        вимагається чинним законодавством, рішенням будь-якого суду компетентної
        юрисдикції або будь-якого регуляторного, судового, урядового або
        аналогічного органу компетентної юрисдикції, за умови, що Замовник,
        наскільки це дозволено чинним законодавством, надає Виконавцю, якомога
        повне повідомлення про таке розкриття. 8.3. У випадку несанкціонованого
        розголошення Замовником Конфіденційної Замовник, зобов'язаний негайно
        повідомити Виконавця про відповідне розголошення Конфіденційної
        інформації у письмовій формі та сприяти Виконавцю в обмеженні порушень
        його прав, спричинених цим порушенням. Замовник, співпрацюватиме з
        Виконавцем у разі пред'явлення претензій до третіх осіб за
        несанкціоноване використання відповідної інформації. Замовник визнає, що
        несанкціоноване розкриття, використання або розпорядження, як фактичне,
        так і з погрозою, будь-якою Конфіденційною інформацією може завдати
        непоправної шкоди, призвести до втрати бізнесу та значних збитків
        Виконавцю. Таким чином, Замовник погоджуюється що, в разі порушня
        Замовником умов конфіденційності визначених в пп. 8.1.-8.3. цього
        договору, Виконавець може вимагати від Замовника відшкодування завданої
        шкоди та користуватись всіма правами наданими чинним законодавством на
        відновленя порушених прав. 9. ФОРС-МАЖОР 9.1. Сторони звільняються від
        відповідальності за часткове або повне невиконання зобов'язань за цим
        Договором, якщо це невиконання стало наслідком дії обставин непереборної
        сили (форс-мажорних обставин), що виникли після укладення цього Договору
        та унеможливили виконання зобов'язань відповідно до умов цього Договору.
        До таких обставин зокрема, але не обмежуючись, належать надзвичайні
        ситуації техногенного, природного чи екологічного характеру, аварії у
        системах електропостачання, руйнування цих систем, спричинені, зокрема,
        землетрусами, повенями, ураганами тощо., тривала відсутність
        електроенергії та інтернету з незалежних від сторін причин, воєнні дії,
        заколот, страйк, масові заворушення, заворушення та інші протиправні
        дії, а також стан здоров'я Виконавця (або провідного вебінару), повінь,
        пожежа, антитерористичні операції, землетрус та інші стихійні лиха,
        війна, військові дії, неконтрольовані, протиправні дії та акти
        вандалізму третіх осіб, революційні дії, громадські заворушення, акти чи
        дії органів державного управління, прийняття законних чи підзаконних
        актів, що прямо впливають на можливість виконання сторонами умов цього
        договору, та будь-які інші надзвичайні обставини. 9.2. Сторони
        домовились, що у разі виникнення обставин, передбачених п. 10.1.
        Договору, термін виконання зобов'язань за цим Договором відсувається на
        період часу, протягом якого діяли ці обставини та їх наслідки. 9.3. Якщо
        форс-мажорні обставини та їх наслідки продовжують діяти понад шість
        місяців, сторони у найкоротші терміни повинні провести переговори з
        метою виявлення прийнятних для обох Сторін альтернативних способів
        виконання умов цього Договору та досягнення відповідних письмових
        домовленостей. 10. ІНШІ ПОЛОЖЕННЯ 10.1. Замовник гарантує, що всі умови
        оферти йому зрозумілі і він приймає їх безумовно та в повному обсязі,
        без будь-яких умов, вилучень та застережень. 10.2. У разі, який не
        врегульований цим Договором, Сторони зобов'язуються керуватись нормами,
        встановленими чинним законодавством України. 10.3. До цього договору
        застосовується законодавство України. 10.4. Сторони дають одна одній
        згоду на обробку та зберігання персональних даних, які стають відомими
        ним, у зв'язку із укладенням цього Договору, у межах, у яких це
        необхідно відповідно до вимог чинного законодавства України.
      </text>
    </div>
  );
};

export default PublickOfferts;
